In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.Series([1,2,3,4,5,6,np.nan,7,8])
df

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    NaN
7    7.0
8    8.0
dtype: float64

In [6]:
d = pd.date_range('20210309', periods= 10)
d

DatetimeIndex(['2021-03-09', '2021-03-10', '2021-03-11', '2021-03-12',
               '2021-03-13', '2021-03-14', '2021-03-15', '2021-03-16',
               '2021-03-17', '2021-03-18'],
              dtype='datetime64[ns]', freq='D')

In [7]:
ds = pd.DataFrame(np.random.randn(10,4), index =d, columns = (['A','B','C','D']))
ds

                   A         B         C         D
2021-03-09  1.229249  1.095718  0.208834  0.891378
2021-03-10  0.690797  1.504925 -0.140648  0.403814
2021-03-11 -0.854723 -0.951990 -0.964539 -0.400697
2021-03-12 -0.448133 -2.125777  0.531854 -0.190053
2021-03-13 -0.026316 -0.277074 -0.349485  0.127623
2021-03-14 -0.505807  1.246589  0.370630  0.971582
2021-03-15  0.369168 -1.039923  0.090498 -0.786438
2021-03-16 -0.273540  0.181676  0.440507  0.999844
2021-03-17 -0.798550 -1.361407 -1.047249  0.106954
2021-03-18 -0.057516 -1.067136 -0.260323 -1.442173

In [1]:
xyz_web = {'Names':['Sunil','Pradeep','Bhanu','Hari'], 'Age':[25,26,17,16]}

In [4]:
df = pd.DataFrame(xyz_web)
df

     Names  Age
0    Sunil   25
1  Pradeep   26
2    Bhanu   17
3     Hari   16

# Slicing

In [5]:
df.head(2)

     Names  Age
0    Sunil   25
1  Pradeep   26

In [6]:
df.tail(2)

   Names  Age
2  Bhanu   17
3   Hari   16

# Merging

In [20]:
df1 = pd.DataFrame({'HPI': [80,90,70,60], 'Int_Rate': [2,1,2,3], 'Ind_Gdp': [50,45,45,67]}, index= [2001,2002,2003,2004])

In [21]:
df2 = pd.DataFrame({'BPI': [80,90,70,60], 'Int_Rate': [2,1,2,3], 'Ind_Gdp': [50,45,45,67]}, index = [2005,2006,2007,2008])

In [22]:
merge = pd.merge(df1,df2)
merge

   HPI  Int_Rate  Ind_Gdp  BPI
0   80         2       50   80
1   90         1       45   90
2   70         2       45   70
3   60         3       67   60

In [24]:
merge = pd.merge(df1,df2, on = 'Int_Rate')
merge

   HPI  Int_Rate  Ind_Gdp_x  BPI  Ind_Gdp_y
0   80         2         50   80         50
1   80         2         50   70         45
2   70         2         45   80         50
3   70         2         45   70         45
4   90         1         45   90         45
5   60         3         67   60         67

In [13]:
df1 = pd.DataFrame({'Int_Rate':[1,2,3,4], 'Gdp_Rate': [5,6,7,8]}, index = [2001,2002,2003,2004])

In [14]:
df2 = pd.DataFrame({'Low_Tier_Rate':[5,6,7,8], 'Unemployed':[1,2,3,4]}, index = [2001,2003,2004,2005])

# Joining

In [18]:
joined = df2.join(df1)
joined

      Low_Tier_Rate  Unemployed  Int_Rate  Gdp_Rate
2001              5           1       1.0       5.0
2003              6           2       3.0       7.0
2004              7           3       4.0       8.0
2005              8           4       NaN       NaN

In [19]:
joined = df1.join(df2)
joined

      Int_Rate  Gdp_Rate  Low_Tier_Rate  Unemployed
2001         1         5            5.0         1.0
2002         2         6            NaN         NaN
2003         3         7            6.0         2.0
2004         4         8            7.0         3.0

# Changing the Index and Column Headers

In [32]:
df1 = pd.DataFrame({'HPI': [80,90,70,60], 'Int_Rate': [2,1,2,3], 'Ind_Gdp': [50,45,45,67]}, index= [2001,2002,2003,2004])
df1

      HPI  Int_Rate  Ind_Gdp
2001   80         2       50
2002   90         1       45
2003   70         2       45
2004   60         3       67

In [33]:
df1.set_index('Int_Rate', inplace = True)
df1

          HPI  Ind_Gdp
Int_Rate
2          80       50
1          90       45
2          70       45
3          60       67

In [38]:
df1 = pd.DataFrame({'HPI': [80,90,70,60], 'Int_Rate': [2,1,2,3], 'Ind_Gdp': [50,45,45,67]}, index= [2001,2002,2003,2004])
df1 = df1.rename(columns = {'Int_Rate': 'GDP_Rate'})
df1

      HPI  GDP_Rate  Ind_Gdp
2001   80         2       50
2002   90         1       45
2003   70         2       45
2004   60         3       67

# Concatination

In [39]:
df1 = pd.DataFrame({'Int_Rate':[1,2,3,4], 'Gdp_Rate': [5,6,7,8]}, index = [2001,2002,2003,2004])

In [40]:
df2 = pd.DataFrame({'Low_Tier_Rate':[5,6,7,8], 'Unemployed':[1,2,3,4]}, index = [2001,2003,2004,2005])

In [41]:
concat = pd.concat([df1,df2])
concat

      Int_Rate  Gdp_Rate  Low_Tier_Rate  Unemployed
2001       1.0       5.0            NaN         NaN
2002       2.0       6.0            NaN         NaN
2003       3.0       7.0            NaN         NaN
2004       4.0       8.0            NaN         NaN
2001       NaN       NaN            5.0         1.0
2003       NaN       NaN            6.0         2.0
2004       NaN       NaN            7.0         3.0
2005       NaN       NaN            8.0         4.0

In [45]:
df = pd.DataFrame(np.random.rand(5,4), index = ['A','B','C','D','E'], columns= [1,2,3,4])
df

          1         2         3         4
A  0.829872  0.179824  0.621101  0.169863
B  0.259547  0.793040  0.748463  0.473764
C  0.832161  0.772455  0.241190  0.752246
D  0.429421  0.551114  0.240961  0.769058
E  0.971797  0.326855  0.145962  0.264816

In [51]:
df = pd.Series(np.random.rand(10))
df

0    0.651886
1    0.452182
2    0.311230
3    0.522555
4    0.904980
5    0.415554
6    0.701125
7    0.977330
8    0.102508
9    0.141642
dtype: float64